In [38]:
import pandas as pd

In [39]:
df = pd.read_csv('main.csv')
print(df)

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [40]:
df.drop(['user_id','gender', 'zip_code'], axis = 1, inplace = True)

In [41]:
gbdf = df.groupby('occupation').agg({'age':['min', 'max']})

In [42]:
gbdf.head()

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70

In [44]:
gbdf.to_csv('main.csv')